SCREEN_WIDTH = 1100
SCREEN_HEIGHT = 800

BACKGROUND_IMAGE_PATH = 'src/背景.png'
BLUE_BALL_IMAGE_PATH = 'src/蓝球.png'
RED_BALL_IMAGE_PATH = 'src/红球.png'
HEART_IMAGE_PATH = 'src/爱心.png'
PLATFORM_IMAGE_PATH = 'src/平台.png'
REPLAY_BUTTON_IMAGE_PATH = 'src/重玩.png'
NEXT_BUTTON_IMAGE_PATH = 'src/下一关.png'
TRAMPOLINE_IMAGE_PATH = 'src/蹦床.png'
SPIKE_IMAGE_PATH = 'src/尖刺.png'
CANNON_IMAGE_PATH = 'src/火炮.png'
BULLET_IMAGE_PATH = 'src/炮弹.png'

# 音效资源路径
JUMP_SOUND_PATH = 'src/跳跃.wav'

# 第一关
LEVEL1_PLATFORMS = [
    (500, 650), (650, 550), (800, 450), (950, 350),
    (800, 250), (650, 150), (500, 250), (350, 150),
    (200, 250), (50, 350), (200, 450), (350, 550)
]

LEVEL1_HEARTS = [
    (527, 610), (677, 510), (827, 410), (977, 310),
    (827, 210), (677, 110), (527, 210), (377, 110),
    (227, 210), (77, 310), (227, 410), (377, 510)
]

LEVEL1_TRAMPOLINES = []

# 第二关
LEVEL2_PLATFORMS = [
    (100, 650), (200, 550), (100, 450), (200, 350),  # 左侧平台
    (900, 650), (800, 550), (900, 450), (800, 350)   # 右侧平台
]



LEVEL2_HEARTS = [
    (350, 650), (350, 550), (350, 450), (350, 350), (350, 250), # 左侧爱心列
    (650, 650), (650, 550), (650, 450), (650, 350), (650, 250), # 右侧爱心列
    (500, 120)  # 中间高处的爱心
]



LEVEL2_TRAMPOLINES = [
    (345, 700), (645, 700)
]

LEVEL2_SPIKES = [
    (495, 720)
]

LEVEL2_CANNONS = [
    (500, 50)
]

# 第三关
LEVEL3_TRAMPOLINES = [
    (517, 700),(575,650),(401, 600), (633, 600), (691,550),
    (284,500), (750, 500), (808,450),(459,650),(343,550),(226,450),
    (167, 400), (866, 400)
]

LEVEL3_SPIKES = [

]

LEVEL3_HEARTS = [
(321,207),(381,207),(441,207),(651,207),(711,207),  
(291,247),(351,247),(411,247),(471,247),(591,247),(651,247),(711,247),(771,247),  
(261,287),(321,287),(381,287),(441,287),(501,287),(561,287),(621,287),(681,287),(741,287),(801,287),  
(261,327),(321,327),(381,327),(441,327),(501,327),(561,327),(621,327),(681,327),(741,327),(801,327),  
(261,367),(321,367),(381,367),(441,367),(501,367),(561,367),(621,367),(681,367),(741,367),(801,367),  
(261,407),(321,407),(381,407),(441,407),(501,407),(561,407),(621,407),(681,407),(741,407),(801,407),  
(291,447),(351,447),(411,447),(471,447),(591,447),(651,447),(711,447),(771,447),  
(321,487),(381,487),(441,487),(501,487),(561,487),(621,487),(681,487),(741,487),  
(351,527),(411,527),(471,527),(531,527),(591,527),(651,527),  
(411,567),(471,567),(531,567),(591,567),  
(471,607),(531,607),  
(501,647),(561,647),  
(531,687),
]

LEVEL3_CANNONS = [
    (180, 50),  (530, 50),
    (880, 50)
]


# 将所有关卡配置保存
LEVEL_CONFIG = {
    1: {
        "platforms": LEVEL1_PLATFORMS,
        "hearts": LEVEL1_HEARTS,
        "trampolines": LEVEL1_TRAMPOLINES,
        "spikes": [],
        "cannons": []
    },
    2: {
        "platforms": LEVEL2_PLATFORMS,
        "hearts": LEVEL2_HEARTS,
        "trampolines": LEVEL2_TRAMPOLINES,
        "spikes": LEVEL2_SPIKES,
        "cannons": LEVEL2_CANNONS
    },
    3: {
        "platforms": [],
        "hearts": LEVEL3_HEARTS,
        "trampolines": LEVEL3_TRAMPOLINES,
        "spikes": LEVEL3_SPIKES,
        "cannons": LEVEL3_CANNONS
    }
}